{
  "ir_version": "1.0",
  "project": "release-agent-team",
  "repository": "https://github.com/agentplexus/release-agent-team",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "v0.5.1",
      "date": "2026-01-18",
      "highlights": [
        { "description": "Dependency `github.com/agentplexus/aiassistkit` has been renamed to `github.com/agentplexus/assistantkit`" }
      ],
      "dependencies": [
        { "description": "Renamed dependency `github.com/agentplexus/aiassistkit` v0.4.0 to `github.com/agentplexus/assistantkit` v0.5.0", "commit": "4c761d0" },
        { "description": "Updated go.mod dependencies", "commit": "47c9cff" },
        { "description": "Bump `actions/setup-go` from 5 to 6", "commit": "6c4f4ca" },
        { "description": "Bump `actions/checkout` from 4 to 6", "commit": "f2a30c6" },
        { "description": "Bump `actions/setup-python` from 5 to 6", "commit": "7ea71db" }
      ],
      "documentation": [
        { "description": "Added icons to Features section in README", "commit": "ee90d37" },
        { "description": "Updated Homebrew install instructions to use `brew tap` for search support", "commit": "67e7ade" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Report types now use canonical IR from multi-agent-spec SDK with JSON schema conformance" },
        { "description": "Reports display teams in DAG order (PM first, parallel teams alphabetically, Release last)" }
      ],
      "added": [
        { "description": "DAG-aware sorting for team reports using topological sort with alphabetical tie-breaking", "commit": "d72d668" },
        { "description": "`DependsOn` field in TeamConfig to track DAG dependencies between validation teams", "commit": "d72d668" },
        { "description": "GoReleaser workflow for automated Homebrew formula publishing to `agentplexus/homebrew-tap`", "commit": "2a4352f" },
        { "description": "Structured task definitions in agent specs with `id`, `type`, `command`, `required`, and `expected_output` fields", "commit": "3e589b7" },
        { "description": "Typed inputs/outputs for workflow steps in team spec enabling data flow between agents", "commit": "3e589b7" },
        { "description": "Runtime configuration in deployment spec for distributed mode (timeouts, retries, observability)", "commit": "3e589b7" },
        { "description": "New deployment targets: `gemini-cli`, `adk-server`, `k8s-production`", "commit": "3e589b7" }
      ],
      "changed": [
        { "description": "Report package refactored to use `multiagentspec.TeamReport`, `TeamSection`, `Check`, and `Status` types from multi-agent-spec SDK", "commit": "cfa5497" },
        { "description": "Renderer now uses `multiagentspec.NewRenderer` which auto-sorts teams by DAG order", "commit": "cfa5497" },
        { "description": "Reports include richer metadata: `$schema`, `generated_at`, `generated_by`, per-team `status`", "commit": "cfa5497" },
        { "description": "Security checker excludes itself from hardcoded secrets scan to prevent false positives", "commit": "19d0863" },
        { "description": "Release-validation now depends on all validation steps (qa, docs, security) enabling commit and CHANGELOG workflow", "commit": "9011cac" },
        { "description": "Agent specs now use `requires` instead of `dependencies` for tool prerequisites", "commit": "3e589b7" },
        { "description": "Team spec version bumped to 1.1.0 with enhanced workflow schema", "commit": "3e589b7" }
      ],
      "removed": [
        { "description": "`pkg/report/report.go` - Types moved to multi-agent-spec", "commit": "cfa5497" },
        { "description": "`pkg/report/renderer.go` - Renderer moved to multi-agent-spec", "commit": "cfa5497" },
        { "description": "`pkg/report/ir.go` - IR types moved to multi-agent-spec", "commit": "cfa5497" },
        { "description": "`specs/teams/release-team.yaml` - consolidated to JSON format", "commit": "3e589b7" }
      ],
      "dependencies": [
        { "description": "Updated `github.com/agentplexus/multi-agent-spec/sdk/go` to v0.3.0", "commit": "e3ff5ef" }
      ],
      "documentation": [
        { "description": "Added release notes for v0.5.0", "commit": "a1ad92e" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Multi-agent team architecture with 6 specialized agents (PM, QA, Documentation, Security, Release, Coordinator) and DAG workflow orchestration" },
        { "description": "Repository moved to github.com/agentplexus/release-agent-team with renamed binary `release-agent-team`" }
      ],
      "added": [
        { "description": "Multi-agent team spec with `team.json` defining 6 agents and DAG workflow", "commit": "8268317" },
        { "description": "Deployment spec with `deployment.json` for multi-platform targets (Claude Code, Kiro CLI, AgentKit, AWS Bedrock)", "commit": "8268317" },
        { "description": "Canonical agent definitions in `agents/` directory", "commit": "8268317" },
        { "description": "Claude Code plugin with 6 specialized agents for team-based release automation", "commit": "c043b97" },
        { "description": "Kiro CLI plugin with JSON-based agent configurations and steering files", "commit": "4dba15a" },
        { "description": "Gemini CLI extension documentation", "commit": "aec71a2" }
      ],
      "changed": [
        { "description": "Module path from `github.com/grokify/release-agent` to `github.com/agentplexus/release-agent-team`", "breaking": true, "commit": "9b1503b" },
        { "description": "Binary name from `releaseagent` to `release-agent-team`", "breaking": true, "commit": "1b5789f" },
        { "description": "Homebrew formula from `grokify/tap/releaseagent` to `agentplexus/tap/release-agent-team`", "breaking": true, "commit": "1b5789f" },
        { "description": "Claude Code plugin name from `release-agent` to `release-agent-team`", "commit": "c043b97" },
        { "description": "Plugin install command to `claude plugin add github:agentplexus/release-agent-team/plugins/claude`", "commit": "c043b97" }
      ],
      "documentation": [
        { "description": "Updated README with multi-agent team branding and new installation commands", "commit": "aec71a2" },
        { "description": "Updated all command examples to use `release-agent-team` binary", "commit": "1b5789f" },
        { "description": "Updated GoReleaser configuration for new binary and Homebrew tap", "commit": "1b5789f" },
        { "description": "Updated MkDocs configuration for agentplexus organization", "commit": "aec71a2" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-12",
      "highlights": [
        { "description": "Complete transformation from pre-push validation tool to release automation platform with workflow engine, Claude Code integration, and multi-platform plugin support" }
      ],
      "added": [
        { "description": "CLI restructure with Cobra framework and 7 commands: `check`, `validate`, `release`, `changelog`, `readme`, `roadmap`, `version`", "commit": "554e12a" },
        { "description": "Release workflow engine with 9-step process: validate → check → changelog → commit → push → CI wait → tag", "commit": "960f1c8" },
        { "description": "Comprehensive validation command with 4 areas: QA, Documentation, Release, Security", "commit": "554e12a" },
        { "description": "Team status report format (`--format team`) with template-based box output", "commit": "0ce034f" },
        { "description": "Report package (`pkg/report`) with structured data types and text/template renderer", "commit": "0ce034f" },
        { "description": "Actions framework with `Run()`, `Propose()`, `Apply()` pattern", "commit": "960f1c8" },
        { "description": "ChangelogAction with schangelog integration", "commit": "960f1c8" },
        { "description": "RoadmapAction with sroadmap integration", "commit": "960f1c8" },
        { "description": "ReadmeAction for badge and version updates", "commit": "960f1c8" },
        { "description": "Interactive mode with `--interactive` flag for Claude Code", "commit": "960f1c8" },
        { "description": "JSON output mode with `--json` flag", "commit": "a1d48f7" },
        { "description": "TOON output format (Token-Oriented Object Notation) ~8x more token-efficient", "commit": "a1d48f7" },
        { "description": "Claude Code plugin with commands, skills, agents, and hooks", "commit": "e2602b2" },
        { "description": "Gemini plugin support via platform adapters", "commit": "e2602b2" },
        { "description": "SecurityChecker: LICENSE, govulncheck, dependency audit, secret detection", "commit": "554e12a" },
        { "description": "DocChecker: README, PRD, TRD, release notes, changelog validation", "commit": "554e12a" },
        { "description": "ReleaseChecker: version format, git status, CI configuration", "commit": "554e12a" },
        { "description": "Error handling compliance check (detects `_ = err` patterns)", "commit": "554e12a" },
        { "description": "Git wrapper package with tag, commit, push, status operations", "commit": "960f1c8" },
        { "description": "CI status checking via gh CLI with WaitForCI support", "commit": "960f1c8" },
        { "description": "GoReleaser configuration for multi-platform builds", "commit": "3e8dcc9" },
        { "description": "Homebrew formula", "commit": "3e8dcc9" }
      ],
      "changed": [
        { "description": "Module path from `github.com/grokify/prepush` to `github.com/grokify/release-agent`", "breaking": true, "commit": "554e12a" },
        { "description": "Package structure from flat to `cmd/` and `pkg/` layout", "breaking": true, "commit": "554e12a" },
        { "description": "Configuration file from `.prepush.yaml` to `.releaseagent.yaml`", "commit": "554e12a" }
      ],
      "documentation": [
        { "description": "Updated README with all new commands and features", "commit": "51320ae" },
        { "description": "Updated PRD with completed feature status", "commit": "51320ae" },
        { "description": "Updated TRD with new architecture and interfaces", "commit": "51320ae" },
        { "description": "Added MkDocs documentation site with Material theme", "commit": "f8f3024" },
        { "description": "Added release notes for v0.3.0", "commit": "f8f3024" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Catch more issues locally with new `go build` and `go mod tidy` checks, plus soft warnings that inform without blocking" }
      ],
      "added": [
        { "description": "Go check: `go mod tidy` to verify go.mod/go.sum are up to date", "commit": "7d15a92" },
        { "description": "Go check: `go build` to ensure project compiles", "commit": "7d15a92" },
        { "description": "Go check: untracked references detection (soft warning)", "commit": "7d15a92" },
        { "description": "Soft warnings system: checks that report issues but don't fail the build", "commit": "7d15a92" },
        { "description": "Git hook setup instructions with three options (script, symlink, shared hooks)", "commit": "01205fa" }
      ],
      "fixed": [
        { "description": "Directory walking now correctly handles current directory (`.`)", "commit": "d00548b" }
      ],
      "documentation": [
        { "description": "Expanded README with git hook setup options and bypass instructions", "commit": "01205fa" },
        { "description": "Added Go checks detail table documenting hard vs soft checks", "commit": "01205fa" },
        { "description": "Updated example output to show all 7 checks including warnings", "commit": "01205fa" },
        { "description": "Added CHANGELOG and release notes for v0.2.0", "commit": "e90fa66" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "One command to run all pre-push checks across Go, TypeScript, and JavaScript - with auto-detection and monorepo support" }
      ],
      "added": [
        { "description": "Multi-language pre-push hook with auto-detection", "commit": "729733d" },
        { "description": "Go checks: `gofmt`, `golangci-lint`, `go test`, local replace directive detection", "commit": "729733d" },
        { "description": "TypeScript/JavaScript checks: `eslint`, `prettier`, `tsc --noEmit`, `npm test`", "commit": "729733d" },
        { "description": "Language detection for Go, TypeScript, JavaScript, Python, Rust, Swift", "commit": "729733d" },
        { "description": "Monorepo support with multiple language detection per repository", "commit": "729733d" },
        { "description": "Configuration via `.prepush.yaml` with per-language settings", "commit": "729733d" },
        { "description": "CLI flags: `--verbose`, `--no-test`, `--no-lint`, `--no-format`, `--coverage`", "commit": "729733d" }
      ],
      "documentation": [
        { "description": "README with installation, usage, and configuration examples", "commit": "729733d" },
        { "description": "Added CHANGELOG and release notes for v0.1.0", "commit": "6a78e95" }
      ],
      "tests": [
        { "description": "Unit tests for detect, config, and checks packages", "commit": "729733d" }
      ]
    }
  ]
}
